import UIKit

/*
 คอลเล็กชันใน Swift คือชนิดข้อมูลที่ใช้ในการเก็บกลุ่มของข้อมูลเข้าด้วยกัน เช่น รายการของข้อมูลหรือคู่ค่า (key-value pair) ดังนี้
 */

// 1. Array: เป็นกลุ่มข้อมูลที่เรียงต่อกันโดยมีลำดับ สามารถเก็บข้อมูลที่มีประเภทเดียวกันหลายตัวได้ เช่น จำนวนเต็ม หรือสตริง
let numbers = [1, 2, 3, 4, 5]
let names = ["Alice", "Bob", "Charlie"]

// 2. Set: เป็นกลุ่มข้อมูลที่ไม่มีลำดับและไม่มีค่าที่ซ้ำกัน ใช้เมื่อต้องการเก็บข้อมูลที่ไม่ต้องการให้มีค่าซ้ำซ้อน เช่น ชุดข้อมูลที่ไม่มีสมาชิกซ้ำกัน
let uniqueNumbers: Set<Int> = [1, 2, 3, 4, 5]
let uniqueCharacters: Set<Character> = ["a", "b", "c"]

// 3.Dictionary: เป็นกลุ่มข้อมูลที่เก็บข้อมูลเป็นคู่ค่า (key-value pair) โดยมีค่า key แต่ละตัวต้องไม่ซ้ำกัน เช่น ข้อมูลที่ต้องการทำการจับคู่
let ages = ["Alice": 30, "Bob": 25, "Charlie": 35]
let fruitStocks = ["Apple": 100, "Banana": 50, "Orange": 75]
