import UIKit

/*
 คำถาม: คำสั่งใดที่เป็นคำสั่งควบคุมการโอนย้ายการควบคุมใน Swift?

 Continue
 Break
 Fallthrough
 ทั้งหมดที่กล่าวมา
 
 ใน Swift, คำสั่งควบคุมการโอนย้ายการควบคุมที่ใช้ได้คือ:
  1. Continue - ใช้เพื่อข้ามการทำงานของ loop ในรอบปัจจุบันและดำเนินการต่อไปยังรอบถัดไป
 2. Break - ใช้เพื่อหยุดการทำงานของ loop หรือ switch statement ทันที
 3. Fallthrough - ใช้ใน switch statement เพื่อระบุว่าการทำงานควรจะต่อเนื่องไปยัง case ถัดไปโดยไม่ตรวจสอบเงื่อนไข
 ดังนั้น, คำตอบคือ "ทั้งหมดที่กล่าวมา"

 */

