import UIKit

/*
 ฟังก์ชัน Variadic
 ใน Swift, ฟังก์ชัน variadic เป็นฟังก์ชันที่สามารถรับจำนวนอาร์กิวเมนต์แปรผันได้ไม่จำกัดจำนวนและสามารถเป็นประเภทใดก็ได้ มันใช้สัญลักษณ์จุดไข่ปลา (...)
 */

func printSum(_ numbers: Double...) {
   var sum: Double = 0
   for number in numbers {
      sum += number
   }
   print("Sum: \(sum)")
}

printSum(1.0, 2.0, 3.0) // Sum: 6.0
printSum(10.5, 20.25, 30.75, 40.1) // Sum: 101.6
// ฟังก์ชัน variadic มีประโยชน์เมื่อคุณต้องการรับจำนวนอาร์กิวเมนต์ที่ไม่ทราบจำนวนหรือเมื่อจำนวนอาร์กิวเมนต์อาจเปลี่ยนแปลงได้ในระหว่างการทำงาน
