import UIKit

/*
 สตริงและอักขระ (Strings and Characters)

 เมื่อทํางานกับข้อมูลที่ผู้ใช้ป้อนเข้ามาหรือจัดรูปแบบข้อความ อาจจําเป็นต้องทํางานกับสตริงและดําเนินการบางอย่างเพื่อให้ได้ผลลัพธ์ที่ต้องการ Swift มีวิธีมากมายในการจัดการสตริง เช่น

 - การดําเนินการกับอักขระ ซึ่งช่วยให้จัดการสตริงได้ซับซ้อนขึ้น

 */

var name = "John"

// ตรวจสอบความยาวของ String
print(name.count) // 4

// ตัดอักขระแรกและสุดท้ายออก
name.removeFirst()
name.removeLast()
print(name)

// Loop ผ่านตัวอักขระแต่ล่ะตัว
for char in name {
   print(char)
}
